KanatERPSukhova.КанатАдаптация/src/DataProcessors/МобильноеРабочееМестоКладовщика/МобильноеРабочееМестоКладовщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fdfd35a6-1406-4103-890b-56e84434ce5a">
  <name>МобильноеРабочееМестоКладовщика</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

KanatERPSukhova.КанатАдаптация/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d7a580fb-b3d4-4540-9057-2bf42dbcce49">
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c9fd5a1a-3aa5-4048-b15e-f8b6a41ab96f">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

KanatERPSukhova.КанатАдаптация/src/DataProcessors/МобильноеРабочееМестоКладовщика/Forms/РасходныйОрдер/Module.bsl
// <+БИТ> Руденков_Е.И. 06.08.2024  
// ЧТЗ ШК-1 Канат Процесс штрихкодирования
&НаСервере
&ИзменениеИКонтроль("ОтгрузкаРазрешена")
Функция КАНАТ_ОтгрузкаРазрешена(СвойстваТовара, Количество)
    #Вставка
	Возврат Истина;
	#КонецВставки
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Номенклатура", СвойстваТовара.Номенклатура);
	СтруктураПоиска.Вставить("Характеристика", СвойстваТовара.Характеристика);
	СтруктураПоиска.Вставить("Серия", СвойстваТовара.Серия);
	СтруктураПоиска.Вставить("Назначение", СвойстваТовара.Назначение);

	Литерал = "НомерСтроки";
	НомерСтроки = СвойстваТовара[Литерал];
	Если Не ТоварыПоРаспоряжениям[НомерСтроки].СтатусУказанияСерий = 0 Тогда
		СтруктураПоиска.Вставить("Серия", СвойстваТовара.Серия);
	КонецЕсли;

	ДоступноКОтгрузке = 0;
	РезультатПоиска = ТоварыПоРаспоряжениям.НайтиСтроки(СтруктураПоиска);

	Для Каждого НайденнаяСтрока Из РезультатПоиска Цикл

		КоэффициентУпаковки = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(НайденнаяСтрока.Упаковка, НайденнаяСтрока.Номенклатура);
		ДоступноКОтгрузке = ДоступноКОтгрузке + НайденнаяСтрока.Количество * КоэффициентУпаковки;

	КонецЦикла;

	Если Количество > ДоступноКОтгрузке Тогда
		ТекстОшибки = НСтр("ru = 'Количество товара, которое нужно отгрузить по распоряжениям на отгрузку не равно количеству, которое отгружается ордером.';
		|en = 'Quantity of goods that needs to be shipped under shipment references is not equal to the quantity shipped under the note.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);

		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции 

&НаСервере
&ИзменениеИКонтроль("ЗакончитьОтгрузкуНаСервере")
Функция КАНАТ_ЗакончитьОтгрузкуНаСервере()
	
	ОрдерОбъект = Ссылка.ПолучитьОбъект();
	
	ОрдерОбъект.Помещение   = Помещение;
	ОрдерОбъект.Комментарий = Комментарий;
	ОрдерОбъект.ЗонаОтгрузки = ЗонаОтгрузки;
	
	Если ИспользоватьСкладскиеПомещения И Помещение.Пустая() Тогда
		
		ТекстОшибки = НСтр("ru = 'Не выбрано помещение';
							|en = 'Wareroom is not selected'");
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = СокрЛП(ТекстОшибки);
		СообщениеПользователю.Сообщить();
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"];
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ЗонаОтгрузки.Пустая() И ИспользоватьАдресноеХранение Тогда
		
		ТекстОшибки = НСтр("ru = 'Не выбрана зона отгрузки';
							|en = 'Outbound area is not selected'");
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = СокрЛП(ТекстОшибки);
		СообщениеПользователю.Сообщить();
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["СтраницаИнформация"];
		
		Возврат Ложь;
		
	КонецЕсли;
	#Удаление	
	Для Каждого Строка Из ТоварыОтгружено Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура", Строка.Номенклатура);
		СтруктураПоиска.Вставить("Характеристика", Строка.Характеристика);
		СтруктураПоиска.Вставить("Серия", Строка.Серия);
		СтруктураПоиска.Вставить("Назначение", Строка.Назначение);
				
		РезультатПоиска = ОрдерОбъект.ОтгружаемыеТовары.НайтиСтроки(СтруктураПоиска);
		Для Каждого Результат Из РезультатПоиска Цикл     
			
			Если Не Результат.Упаковка.Пустая() И Не Результат.Упаковка = Строка.Упаковка Тогда
				Продолжить;
			КонецЕсли;
				
			РазницаКоличествоУпаковок = Результат.КоличествоУпаковок - Строка.КоличествоУпаковок;
			РазницаКоличество = Результат.Количество - Строка.Количество;
			
			Результат.КоличествоУпаковок = Строка.КоличествоУпаковок;
			Результат.Количество = Строка.Количество;
			Результат.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
			Результат.Упаковка = Строка.Упаковка;
			
			Если РазницаКоличество > 0 Тогда
				НоваяСтрока = ОрдерОбъект.ОтгружаемыеТовары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
				НоваяСтрока.КоличествоУпаковок = РазницаКоличествоУпаковок;
				НоваяСтрока.Количество = РазницаКоличество;
				НоваяСтрока.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отобрать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	#КонецУдаления   
	#Вставка
	ТЗПоРаспоряжению = ОрдерОбъект.ТоварыПоРаспоряжениям.Выгрузить();
	СтруктураПоиска = Новый Структура("Номенклатура,Характеристика,Назначение");
	
	ОрдерОбъект.ОтгружаемыеТовары.Очистить();
	ОрдерОбъект.ТоварыПоРаспоряжениям.Очистить();
	
	//Заполнение ТЧ ОтгружаемыеТовары
	Для Каждого Строка Из ТоварыОтгружено Цикл
		НоваяСтрока = ОрдерОбъект.ОтгружаемыеТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
		НоваяСтрока.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
		Если ЗначениеЗаполнено(НоваяСтрока.Серия) 
			И Не ЗначениеЗаполнено(НоваяСтрока.СтатусУказанияСерий) Тогда
			НоваяСтрока.СтатусУказанияСерий = Обработки.МобильноеРабочееМестоКладовщика.ПолучитьСтатусУказанияСерий(НоваяСтрока.Серия);
		КонецЕсли;
	КонецЦикла;
	
	//Заполнение ТЧ ТоварыПоРаспоряжениям
	Для каждого СтрокаТЧ Из ТоварыОтгружено Цикл
		НоваяСтрока = ОрдерОбъект.ТоварыПоРаспоряжениям.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТЧ);
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрокаТЧ);
		НайденныеСтроки = ТЗПоРаспоряжению.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда
			НоваяСтрока.Распоряжение = НайденныеСтроки[0].Распоряжение;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТЧ.Упаковка) Тогда
			КоэффициентУпаковки = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(СтрокаТЧ.Упаковка,НоваяСтрока.Номенклатура);
		Иначе
			КоэффициентУпаковки = 1;
		КонецЕсли;
		
		НоваяСтрока.Количество = СтрокаТЧ.КоличествоУпаковок * КоэффициентУпаковки;
	КонецЦикла;
	
	//Контроль остатков
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыОтгружено.Номенклатура КАК Номенклатура,
	|	ТоварыОтгружено.Характеристика КАК Характеристика,
	|	ТоварыОтгружено.Серия КАК Серия,
	|	ТоварыОтгружено.Упаковка КАК Упаковка,
	|	ТоварыОтгружено.Количество КАК Количество,
	|	ТоварыОтгружено.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТоварыОтгружено.Назначение КАК Назначение
	|ПОМЕСТИТЬ ВтТоварыОтгружено
	|ИЗ
	|	&ТоварыОтгружено КАК ТоварыОтгружено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТоварыОтгружено.Номенклатура КАК Номенклатура,
	|	ВтТоварыОтгружено.Характеристика КАК Характеристика,
	|	ВтТоварыОтгружено.Серия КАК Серия,
	|	ВтТоварыОтгружено.Упаковка КАК Упаковка,
	|	ВтТоварыОтгружено.Количество КАК Количество,
	|	ВтТоварыОтгружено.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВтТоварыОтгружено.Назначение КАК Назначение,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ВтТоварыОтгружено.Количество КАК Нехватка
	|ИЗ
	|	ВтТоварыОтгружено КАК ВтТоварыОтгружено
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Период, ) КАК ТоварыНаСкладахОстатки
	|		ПО ВтТоварыОтгружено.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ВтТоварыОтгружено.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	|			И ВтТоварыОтгружено.Серия = ТоварыНаСкладахОстатки.Серия
	|			И ВтТоварыОтгружено.Назначение = ТоварыНаСкладахОстатки.Назначение
	|			И (ТоварыНаСкладахОстатки.Склад = &Склад)
	|			И (ТоварыНаСкладахОстатки.Помещение = &Помещение)
	|ГДЕ
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ВтТоварыОтгружено.Количество < 0";
	
	Запрос.УстановитьПараметр("ТоварыОтгружено"	,ТоварыОтгружено.Выгрузить());
	Запрос.УстановитьПараметр("Помещение"		,Помещение);
	Запрос.УстановитьПараметр("Склад"			,Склад);
	Запрос.УстановитьПараметр("Период"			,ОрдерОбъект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда//Есть нехватка товаров на складе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Невозможно провести расходный ордер из-за нехватки товаров на складе:";
		Сообщение.Сообщить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Нехватка товара %1, %2 составляет: %3",Выборка.Номенклатура.Артикул,Выборка.Серия,Выборка.Нехватка);
			Сообщение.Сообщить();
		КонецЦикла;
		
		Возврат Ложь;
	КонецЕсли;
	#КонецВставки

	Если ТоварыОтгружено.Количество() Тогда
		ОрдерОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен; 
	КонецЕсли;
	
	ОрдерОбъект.ШтрихкодыУпаковок.Очистить();
	Для Каждого СтрокаШК Из ШтрихкодыУпаковок Цикл
		
		НоваяСтрока = ОрдерОбъект.ШтрихкодыУпаковок.Добавить();
		НоваяСтрока.ШтрихкодУпаковки = СтрокаШК.ШтрихкодУпаковки;
		
	КонецЦикла;
	
	Попытка
		ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//На форме в ТЗ ТоварыКОтгрузке созданы реквизиты КанатПодобраноЗаголовок, КанатОсталосьЗаголовок
	
	//ГруппаПодобраноОсталось = Элементы.Добавить(
	//	"ГруппаПодобраноОсталось",
	//	Тип("ГруппаФормы"),
	//	Элементы.Товары);	
	//ГруппаПодобраноОсталось.Вид = ВидГруппыФормы.ГруппаКолонок;
	//ГруппаПодобраноОсталось.
	
	ШрифтПодобраноОсталось = Новый Шрифт(,,Истина);
	
	НовыйЭлемент  = Элементы.Добавить("КанатТоварыПодобраноЗаголовок",Тип("ПолеФормы"),Элементы.ТоварыГруппа2);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ТоварыКОтгрузке.КанатПодобраноЗаголовок";
	НовыйЭлемент.Заголовок = "Подобрано";
	НовыйЭлемент.Шрифт = ШрифтПодобраноОсталось;
	НовыйЭлемент.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
	
	//Пустое поле для красивого выравнивания
	НовыйЭлемент  = Элементы.Добавить("КанатПустоеПоле1",Тип("ПолеФормы"),Элементы.ТоварыГруппа6);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ТоварыКОтгрузке.КанатПустоеПоле1";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
	НовыйЭлемент  = Элементы.Добавить("КанатТоварыОсталосьЗаголовок",Тип("ПолеФормы"),Элементы.ТоварыГруппа6);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "ТоварыКОтгрузке.КанатОсталосьЗаголовок";
	НовыйЭлемент.Заголовок = "Осталось";
	НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	НовыйЭлемент.Шрифт = ШрифтПодобраноОсталось;
	НовыйЭлемент.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
	
	ОбновитьПодобраноОсталось(0,Неопределено);
	
КонецПроцедуры

// Обновляет реквизиты ТЗ ТоварыКОтгрузке: КанатПодобраноЗаголовок,
// КанатОсталосьЗаголовок, КанатПодобраноКоличествоУпаковок, КанатОсталосьКоличествоУпаковок
//
// Параметры:
//  ДобавитьКПодобрано  - <Число> - число, которое необходимо прибавить к реквизиту
//                 КанатПодобраноКоличествоУпаковок ТЗ ТоварыКОтгрузке. При сканировании 
//                 может быть не равен нулю.
//  ПараметрыТовара  - <Структура, Неопределено> - содержит параметры отсканированного 
//                 товара (Номенклатура, Характеристика, Упаковка, Назначение, Серия)
//
Процедура ОбновитьПодобраноОсталось(ДобавитьКПодобрано=0,ПараметрыТовара=Неопределено)
	
	Если ДобавитьКПодобрано <> 0 
		И ПараметрыТовара <> Неопределено Тогда//Сюда попадаем после сканирования ШК
		
		ПоискССерией = Новый Структура("Номенклатура,Характеристика,Упаковка,Назначение,Серия");
		ЗаполнитьЗначенияСвойств(ПоискССерией,ПараметрыТовара);
		НайденныеСтроки = ТоварыКОтгрузке.НайтиСтроки(ПоискССерией);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ЗаполнитьПодобраноОсталось(НайденныеСтроки[0],ДобавитьКПодобрано);
		Иначе
			ПоискБезСерии = Новый Структура("Номенклатура,Характеристика,Упаковка,Назначение");
			ЗаполнитьЗначенияСвойств(ПоискБезСерии,ПараметрыТовара);
			НайденныеСтроки = ТоварыКОтгрузке.НайтиСтроки(ПоискБезСерии);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ЗаполнитьПодобраноОсталось(НайденныеСтроки[0],ДобавитьКПодобрано);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Для каждого СтрокаТЗ Из ТоварыКОтгрузке Цикл
			ЗаполнитьПодобраноОсталось(СтрокаТЗ,ДобавитьКПодобрано);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПодобраноОсталось(ТекСтрока,ДобавитьКПодобрано=0)
	
	ТекСтрока.КанатПодобраноКоличествоУпаковок	= ТекСтрока.КанатПодобраноКоличествоУпаковок + ДобавитьКПодобрано;
	ТекСтрока.КанатОсталосьКоличествоУпаковок		= ТекСтрока.КоличествоУпаковок - ТекСтрока.КанатПодобраноКоличествоУпаковок;
	ТекСтрока.КанатПодобраноЗаголовок				= "Подобрано: " + ТекСтрока.КанатПодобраноКоличествоУпаковок;
	Если ТекСтрока.КанатОсталосьКоличествоУпаковок >= 0 Тогда
		ТекСтрока.КанатОсталосьЗаголовок	= "Осталось: " + ТекСтрока.КанатОсталосьКоличествоУпаковок;
	Иначе
		ТекСтрока.КанатОсталосьЗаголовок	= "Излишек: " + (-1 * ТекСтрока.КанатОсталосьКоличествоУпаковок);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ОбновитьФормуНаСервере")
Процедура КАНАТ_ОбновитьФормуНаСервере(Результат)

	КоэффициентУпаковки = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(Результат.Упаковка, Результат.Номенклатура);

	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Номенклатура", Результат.Номенклатура);
	СтруктураПоиска.Вставить("Характеристика", Результат.Характеристика);
	СтруктураПоиска.Вставить("Серия", Результат.Серия);
	СтруктураПоиска.Вставить("Упаковка", Результат.Упаковка);
	СтруктураПоиска.Вставить("Назначение", Результат.Назначение);

	Если Результат.Режим = "РедактированиеОтгрузка" Тогда

		Литерал = "НомерСтроки";
		НомерСтроки = Результат[Литерал];

		ИсходноеКоличество = ТоварыОтгружено[НомерСтроки].КоличествоУпаковок;
		Количество = Результат.КоличествоУпаковок * КоэффициентУпаковки;  

		Если ИсходноеКоличество = Количество Тогда		
			Возврат;
		КонецЕсли;    

		Если ОтгрузкаРазрешена(Результат, Количество) Тогда

			ТоварыОтгружено[НомерСтроки].Упаковка           = Результат.Упаковка;
			ТоварыОтгружено[НомерСтроки].КоличествоУпаковок = Результат.КоличествоУпаковок;
			ТоварыОтгружено[НомерСтроки].Количество         = ТоварыОтгружено[НомерСтроки].КоличествоУпаковок * КоэффициентУпаковки;
			ТоварыОтгружено[НомерСтроки].Назначение         = Результат.Назначение;
			ТоварыОтгружено[НомерСтроки].Серия              = Результат.Серия;

			РезультатПоиска = ТоварыКОтгрузке.НайтиСтроки(СтруктураПоиска);
			Если РезультатПоиска.Количество() > 0 Тогда 				
				ОтгружаемоеКоличество = ИсходноеКоличество - Количество; 
				РезультатПоиска[0].КоличествоУпаковок = РезультатПоиска[0].КоличествоУпаковок + ОтгружаемоеКоличество;
				РезультатПоиска[0].Количество = РезультатПоиска[0].КоличествоУпаковок * КоэффициентУпаковки;
			Иначе
				НоваяСтрока = ТоварыКОтгрузке.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
				НоваяСтрока.КоличествоУпаковок = ИсходноеКоличество - Результат.КоличествоУпаковок;
				НоваяСтрока.Количество         = НоваяСтрока.КоличествоУпаковок * КоэффициентУпаковки;
			КонецЕсли;

		Иначе
			Возврат;
		КонецЕсли;

	Иначе

		РезультатПоиска = ТоварыОтгружено.НайтиСтроки(СтруктураПоиска);
		Если РезультатПоиска.Количество() > 0 Тогда
			КоличествоУпаковок = РезультатПоиска[0].КоличествоУпаковок + Результат.КоличествоУпаковок;
			Количество = КоличествоУпаковок * КоэффициентУпаковки;

			Если ОтгрузкаРазрешена(Результат, Количество) Тогда
				РезультатПоиска[0].КоличествоУпаковок = КоличествоУпаковок;
				РезультатПоиска[0].Количество = Количество;
			Иначе
				Возврат;
			КонецЕсли;
		Иначе
			КоличествоУпаковок = Результат.КоличествоУпаковок;
			Количество = КоличествоУпаковок * КоэффициентУпаковки;

			Если ОтгрузкаРазрешена(Результат, Количество) Тогда
				НоваяСтрока = ТоварыОтгружено.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
				НоваяСтрока.Количество = Количество;
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;

		// Уменьшаем количество к отгрузке

		СтруктураПоиска.Удалить("Упаковка");
		РезультатПоиска = ТоварыКОтгрузке.НайтиСтроки(СтруктураПоиска);
		КоличествоОтобрано = Результат.КоличествоУпаковок * КоэффициентУпаковки;

		Для Каждого Строка Из РезультатПоиска Цикл

			Если КоличествоОтобрано = 0 Тогда
				Продолжить;
			КонецЕсли;

			ВычитаемоеЗначение = Мин(Строка.Количество, КоличествоОтобрано);
			Строка.Количество = Строка.Количество - ВычитаемоеЗначение;
			КоличествоОтобрано = КоличествоОтобрано - ВычитаемоеЗначение;

			КоэффициентУпаковки = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки(Строка.Упаковка, Строка.Номенклатура);

			Строка.КоличествоУпаковок = Строка.Количество * КоэффициентУпаковки;

		КонецЦикла;

	КонецЕсли;

	// Удаляем строки если они полностью отработаны

	Сч = 0;
	Пока Сч < ТоварыКОтгрузке.Количество() Цикл

		Если ТоварыКОтгрузке[Сч].Количество <= 0 Тогда
			ТоварыКОтгрузке.Удалить(Сч);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;

	КонецЦикла;

	Для Каждого СтрокаКодМаркировки Из Результат.ШтрихкодыУпаковок Цикл

		НоваяСтрока = ШтрихкодыУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКодМаркировки);

	КонецЦикла;

	СформироватьЗаголовкиКомандМеню();
	
	#Вставка
	ПараметрыТовара = Новый Структура("Номенклатура,Характеристика,Упаковка,Назначение,Серия");
	ЗаполнитьЗначенияСвойств(ПараметрыТовара,Результат);
	ОбновитьПодобраноОсталось(Результат.КоличествоУпаковок,ПараметрыТовара);
	#КонецВставки
	
КонецПроцедуры

&НаКлиенте
Процедура КАНАТ_ОтменитьОтгрузкуВместо(Команда)
	
	ИндексСтроки = ТоварыОтгружено.Индекс(Элементы.ТоварыОтгружено.ТекущиеДанные);
	
	Если ИндексСтроки < 0 Тогда
		Возврат;
	КонецЕсли;
	
	// <+БИТ> Руденков_Е.И. 15.08.2024  
	// ЧТЗ ШК-1 Канат Процесс штрихкодирования
	//КоэффициентУпаковки = ПолучитьКоэффициентУпаковкиСервер(ТоварыОтгружено[ИндексСтроки].Номенклатура, ТоварыОтгружено[ИндексСтроки].Упаковка);
	//
	//СтруктураПоиска = Новый Структура;
	//СтруктураПоиска.Вставить("Номенклатура", ТоварыОтгружено[ИндексСтроки].Номенклатура);
	//СтруктураПоиска.Вставить("Характеристика", ТоварыОтгружено[ИндексСтроки].Характеристика);
	//СтруктураПоиска.Вставить("Серия", ТоварыОтгружено[ИндексСтроки].Серия);
	//СтруктураПоиска.Вставить("Упаковка", ТоварыОтгружено[ИндексСтроки].Упаковка);
	//СтруктураПоиска.Вставить("Назначение", ТоварыОтгружено[ИндексСтроки].Назначение);
	//
	//РезультатПоиска = ТоварыКОтгрузке.НайтиСтроки(СтруктураПоиска);
	//Если РезультатПоиска.Количество() > 0 Тогда
	//	РезультатПоиска[0].КоличествоУпаковок = РезультатПоиска[0].КоличествоУпаковок + ТоварыОтгружено[ИндексСтроки].КоличествоУпаковок;
	//	РезультатПоиска[0].Количество = РезультатПоиска[0].КоличествоУпаковок * КоэффициентУпаковки;
	//Иначе
	//	НоваяСтрока = ТоварыКОтгрузке.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТоварыОтгружено[ИндексСтроки]);
	//	НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок * КоэффициентУпаковки;
	//КонецЕсли;
	
	ТекущиеДанные = Элементы.ТоварыОтгружено.ТекущиеДанные;
	ПараметрыТовара = Новый Структура("Номенклатура,Характеристика,Упаковка,Назначение,Серия");
	ЗаполнитьЗначенияСвойств(ПараметрыТовара,ТекущиеДанные);
	ОбновитьПодобраноОсталось(-ТекущиеДанные.КоличествоУпаковок,ПараметрыТовара);
	// <-БИТ> Руденков_Е.И. 15.08.2024
	
	ТоварыОтгружено.Удалить(ИндексСтроки);
	СформироватьЗаголовкиКомандМеню();
	
	
КонецПроцедуры

&НаКлиенте
Процедура КАНАТ_ТоварыОтгруженоПередУдалениемВместо(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ТоварыОтгружено.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыТовара = Новый Структура("Номенклатура,Характеристика,Упаковка,Назначение,Серия");
	ЗаполнитьЗначенияСвойств(ПараметрыТовара,ТекущиеДанные);
	ОбновитьПодобраноОсталось(-ТекущиеДанные.КоличествоУпаковок,ПараметрыТовара);
	
КонецПроцедуры

&НаКлиенте
Процедура КАНАТ_ТоварыОтгруженоПослеУдаленияВместо(Элемент)
	СформироватьЗаголовкиКомандМеню();
КонецПроцедуры

// <-БИТ> Руденков_Е.И. 06.08.2024
